Revit 2027 API
TriangulationInterfaceForTriangulatedSolidOrShell Constructor
 Construct an interface object for a TriangulatedSolidOrShell.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public TriangulationInterfaceForTriangulatedSolidOrShell(
	TriangulatedSolidOrShell externalTriangulatedSolidOrShell
)
Public Sub New (
	externalTriangulatedSolidOrShell As TriangulatedSolidOrShell
)
public:
TriangulationInterfaceForTriangulatedSolidOrShell(
	TriangulatedSolidOrShell^ externalTriangulatedSolidOrShell
)
new :
        externalTriangulatedSolidOrShell : TriangulatedSolidOrShell -> TriangulationInterfaceForTriangulatedSolidOrShell
Parameters
externalTriangulatedSolidOrShell TriangulatedSolidOrShell
 The TriangulatedSolidOrShell that the interface object represents.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
TriangulationInterfaceForTriangulatedSolidOrShell Class
Autodesk.Revit.DB Namespace